info_items = [
    (1, 'Носки', 'СВЭГ', 'шт.'),
    (2, 'Свитер', 'Молодость', 'шт.'),
    (3, 'Штаны', 'KAPPA', 'шт.'),
    (4, 'Футболка', 'Rick and Morty', 'шт.'),
    (5, 'Кроссовки', 'Adidas', 'шт.'),
    (6, 'Кеды', 'Rick Owens', 'шт.'),
    (7, 'Мука', 'Высший сорт', 'кг'),
    (8, 'Кукуруза', 'Сладкая', 'кг'),
    (9, 'Сахар', 'Белый', 'кг'),
    (10, 'Бананы', 'Желтые', 'кг')
]

info_stores = [
    (1, 'Одежда a', 'ул. Ленина, д. 15', '89876123443'),
    (2, 'Одежда b', 'ул. Свэговая, д. 76', '89876124254'),
    (3, 'Одежда c', 'ул. Курильная, д. 43', '89454545455'),
    (4, 'Одежда d', 'ул. Отцовская, д. 54', '89878745624'),
    (5, 'Одежда e', 'ул. Трешовая, д. 23', '89876763565'),
    (6, 'Одежда f', 'ул. Читальная, д. 87', '89879889809'),
    (7, 'Мука', 'ул. Домовая, д. 54', '89832434543'),
    (8, 'Продукты', 'ул. Дымовая, д. 33', '89872346462'),
    (9, 'Мука', 'ул. Парламентская, д. 18', '89624623656'),
    (10, 'Фрукты', 'ул. Ленина, д. 1', '89632564636')
]

info_store_requests = [
    (1, 1, '2023-02-27'),
    (2, 2, '2023-03-26'),
    (3, 3, '2023-04-21'),
    (4, 4, '2023-03-22'),
    (5, 5, '2023-03-19'),
    (6, 6, '2023-04-17'),
    (7, 7, '2023-04-15'),
    (8, 8, '2023-01-08'),
    (9, 9, '2023-01-09'),
    (10, 10, '2023-04-12')
]

info_stock = [
    (1, 1, 15),
    (2, 2, 20),
    (3, 3, 10),
    (4, 4, 40),
    (5, 5, 100),
    (6, 6, 0),
    (7, 7, 150),
    (8, 8, 30),
    (9, 9, 50),
    (10, 10, 60)
]

info_composition = [
    (1, 1, 1, 5),
    (2, 2, 2, 15),
    (3, 2, 2, 20),
    (4, 4, 4, 10),
    (5, 5, 5, 5),
    (6, 6, 6, 13),
    (7, 7, 7, 11),
    (8, 8, 8, 9),
    (9, 9, 9, 8),
    (10, 10, 10, 12),
]